gururaj-shet/dsPIC-AI-Demo-AEC-EQ/src/audio/engine_synth.c


//===========================================================
// Definition
//===========================================================


//===========================================================
// Enum & Struct typedef
//===========================================================


//===========================================================
// Function Prototype
//===========================================================


//===========================================================
// Variables
//===========================================================


//===========================================================
// Global Function
//===========================================================


#include "app_specific_config_defs.h"
#include <xc.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <string.h>
#include <math.h>   // for fmaxf
#include "pot.h"


#include "engine_synth.h"









// #ifndef M_PI
// #define M_PI 3.14159265358979323846
// #endif //!M_PI

#define MIN_IDLE_RPM        (200.0f)




static enginesynth_wrap_t   s_eng;
static engine_blip_state_t  s_blip;
       bool                 Start_Blip = false;



void app_engine_synth_init(void)
{
    // TDM8: synthesize engine sound to slot0=L, slot1=R
//    EngineSynthWrap_init(&s_eng, SAMPLE_RATE, ENG_I4, 0,           1,           0.3f,             STAGE_1_PROC_CH);
//    EngineSynthWrap_init(&s_eng, SAMPLE_RATE, ENG_V8, 0/*slot L*/, 1/*slot R*/, 0.3f/*mix gain*/, STAGE_1_PROC_CH);
//    EngineSynthWrap_init(&s_eng, SAMPLE_RATE, ENG_V8, 0/*slot L*/, 1/*slot R*/, 0.3f/*mix gain*/, STAGE_1_PROC_CH);
    EngineSynthWrap_init(&s_eng, SAMPLE_RATE, ENG_V8, 0/*slot L*/, 1/*slot R*/, 0.09f/*mix gain*/, STAGE_1_PROC_CH);

    EngineSynth_setRPM(&s_eng.core, 0.0f);    // startup RPM = 0
    EngineSynth_setThrottle(&s_eng.core, 0.3f);

    EngineBlip_init(&s_blip);
}


void app_engine_synth_process(float* p_in, float* p_out)
{
    // 2ch以外では実行しない（できない）
    if (STAGE_1_PROC_CH != 2)
    {
        return;
    }

    // 1) POT -> rpm (arbitrary mapping)
    uint16_t pot = POT_Read();              // 0..0x0FFF
    float pot_rpm = (float)(pot * 2);       // around 0..8190 rpm (same as before)

    // 2) Block time [s]
    float dt = (float)NUM_SAMPLE / (float)SAMPLE_RATE;

    // 3) Triggered by user input
    if ( Start_Blip )
    {
        EngineBlip_trigger(&s_blip, pot_rpm);
        Start_Blip = false;
    }

    // 4) Generate this frame's RPM command (no change needed in process())
    float rpm_cmd = EngineBlip_update(&s_blip, pot_rpm, dt);

    // 5) Apply to core (slew is controlled by existing s->rpm_slew_per_s)
    EngineSynth_setTargetRPM(&s_eng.core, rpm_cmd, s_eng.core.rpm_slew_per_s);

    // 6) Sound synthesis
    engine_process(&s_eng, p_in, p_out, NUM_SAMPLE);
}







/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////



// ==== Blipping implementation ===================================

static inline float clampf(float x, float lo, float hi)
{
    return (x < lo) ? lo : (x > hi) ? hi : x;
}

// Simple easing: 0..1 -> 0..1, p=1 linear, p>1 accelerates toward end
static inline float ease_pow(float x, float p)
{
    if (x <= 0.0f) return 0.0f;
    if (x >= 1.0f) return 1.0f;
    return powf(x, (p > 0.0f) ? p : 1.0f);
}

void EngineBlip_init(engine_blip_state_t* b)
{
    // Default parameters
//    b->p.peak_rpm_default = 4500.0f; // Max RPM for blip (fixed peak)
    b->p.peak_rpm_default = 5000.0f; // Max RPM for blip (fixed peak)
//    b->p.attack_ms        = 120.0f;  // Attack time
    b->p.attack_ms        = 500.0f;  // Attack time
//    b->p.hold_ms          = 100.0f;  // Hold time
    b->p.hold_ms          = 400.0f;  // Hold time
//    b->p.decay_ms         = 350.0f;  // Decay time
    b->p.decay_ms         = 1300.0f;  // Decay time
//    b->p.cooldown_ms      = 300.0f;  // Cooldown to prevent rapid retrigger
    b->p.cooldown_ms      = 0.0f;  // Cooldown to prevent rapid retrigger
    b->p.attack_curve     = 1.4f;    // 1.0=linear, >1 accelerates toward end
//    b->p.decay_curve      = 1.2f;    // 1.0=linear, >1 accelerates toward end
    b->p.decay_curve      = 0.1f;    // 1.0=linear, >1 accelerates toward end

    b->phase      = BLIP_IDLE;
    b->t_in_phase = 0.0f;
    b->rpm_start  = 0.0f;
    b->rpm_peak   = b->p.peak_rpm_default;
}

void EngineBlip_trigger(engine_blip_state_t* b, float pot_rpm)
{
    // Decide this blip's peak based on current POT (clamped by safety range)
    float peak = b->p.peak_rpm_default;

    // Ensure at least +800 rpm above POT (gives a light feel)
    if (peak < pot_rpm + 800.0f)
    {
        peak = pot_rpm + 800.0f;
    }

    b->rpm_start  = pot_rpm;
    b->rpm_peak   = peak;
    b->t_in_phase = 0.0f;
    b->phase      = BLIP_ATTACK;
}

float EngineBlip_update(engine_blip_state_t* b, float pot_rpm, float dt_sec)
{
    const engine_blip_params_t* p = &b->p;

    float rpm_cmd = pot_rpm; // Default follows POT

    switch (b->phase)
    {
    case BLIP_IDLE:
        // Do nothing (follow POT)
        break;

    case BLIP_ATTACK:
    {
        b->t_in_phase += dt_sec;
        float T = p->attack_ms * 0.001f;
        float x = clampf((T > 0.0f) ? (b->t_in_phase / T) : 1.0f, 0.0f, 1.0f);
        float e = ease_pow(x, p->attack_curve);
        rpm_cmd = (1.0f - e) * b->rpm_start + e * b->rpm_peak;

        if (x >= 1.0f) { b->phase = BLIP_HOLD; b->t_in_phase = 0.0f; }
        break;
    }

    case BLIP_HOLD:
    {
        b->t_in_phase += dt_sec;
        rpm_cmd = b->rpm_peak;
        float T = p->hold_ms * 0.001f;
        if (b->t_in_phase >= T) { b->phase = BLIP_DECAY; b->t_in_phase = 0.0f; }
        break;
    }

    case BLIP_DECAY:
    {
        b->t_in_phase += dt_sec;
        float T = p->decay_ms * 0.001f;
        float x = clampf((T > 0.0f) ? (b->t_in_phase / T) : 1.0f, 0.0f, 1.0f);
        float e = ease_pow(x, p->decay_curve);

        // Return-to target is the current POT (naturally adapts even if POT moves)
        rpm_cmd = (1.0f - e) * b->rpm_peak + e * pot_rpm;

        if (x >= 1.0f) { b->phase = BLIP_COOLDOWN; b->t_in_phase = 0.0f; }
        break;
    }

    case BLIP_COOLDOWN:
    {
        b->t_in_phase += dt_sec;
        rpm_cmd = pot_rpm;
        float T = p->cooldown_ms * 0.001f;
        if (b->t_in_phase >= T) { b->phase = BLIP_IDLE; b->t_in_phase = 0.0f; }
        break;
    }
    default:
        b->phase = BLIP_IDLE;
        break;
    }

    // Clamp final output to a safe range (e.g., 600~8000 rpm)
//    return clampf(rpm_cmd, 600.0f, 8000.0f);
    return clampf(rpm_cmd, MIN_IDLE_RPM, 8000.0f);
}


/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////














































static inline float dB_to_linear(float dB)
{
    return powf(10.0f, dB / 20.0f);
}

static void default_tone_for(engine_type_t t, engine_tone_t* tone)
{
    memset(tone, 0, sizeof(*tone));

    tone->baseGain     = 0.35f;
//    tone->outSoftLimit = 0.95f;
    tone->outSoftLimit = 0.65f;


    switch (t)
    {
    default:
    case ENG_I4:  tone->tilt_dB_per_oct = -6.0f; tone->oddBoost_dB  = +2.0f; break;
    case ENG_I5:  tone->tilt_dB_per_oct = -5.0f; tone->oddBoost_dB  = +1.0f; break;
    case ENG_I6:  tone->tilt_dB_per_oct = -4.5f; tone->evenBoost_dB = +2.0f; break;
    case ENG_V8:  tone->tilt_dB_per_oct = -3.5f; tone->evenBoost_dB = +3.0f; break;
    case ENG_V12: tone->tilt_dB_per_oct = -3.0f; tone->evenBoost_dB = +4.0f; break;
    }

    /* Harmonic coefficients are prepared for the full range (ENGINE_MAX_HARM).
       The actual number used is controlled by s->numHarm. */
    for (int n = 0; n < ENGINE_MAX_HARM; n++)
    {
        tone->A_linear[n] = 1.0f / (float)(n + 1);
    }
}

/* --- Public API --- */

void EngineSynthWrap_init(enginesynth_wrap_t* w,
                          float fs,
                          engine_type_t type,
                          int slot_L,
                          int slot_R,
                          float mixGain,
                          int in_buf_ch )
{
    memset(w, 0, sizeof(*w));

    w->in_buf_ch = in_buf_ch;
    w->slot_L    = slot_L;
    w->slot_R    = slot_R;
    w->mixGain   = mixGain;

    engine_synth_t* s = &w->core;
    memset(s, 0, sizeof(*s));
    s->fs = fs;
    s->type = type;
    default_tone_for(type, &s->tone);
    s->rpm_cur = 1000.0f;
    s->rpm_tgt = 1000.0f;
    s->rpm_slew_per_s = 3000.0f;
    s->throttle = 0.5f;


