gururaj-shet/dsPIC-AI-Demo-AEC-EQ/src/audio/engine_synth.c
#if defined(EN_ORG)
    /* Legacy default params */
    w->params.eq_fc_hz          = 110.0f;
    w->params.eq_gain_db        = +6.0f;
    w->params.eq_q              = 0.9f;

    w->params.lpf_min_hz        = 650.0f;
    w->params.lpf_max_hz        = 1800.0f;
    w->params.lpf_q             = 0.707f;
    w->params.lpf_mult          = 18.0f;

    w->params.am_rumble_depth   = 0.22f;
    w->params.am_sub_depth      = 0.10f;

    w->params.noise_post_lpf_hz = 1500.0f;
    w->params.noise_mix         = 0.06f;
#else
    /* Revised default params */
    w->params.eq_fc_hz          = 100.0f;
    w->params.eq_gain_db        = +8.0f;
    w->params.eq_q              = 0.9f;

    w->params.lpf_min_hz        = 550.0f;
    w->params.lpf_max_hz        = 1500.0f;
    w->params.lpf_q             = 0.65f;
    w->params.lpf_mult          = 18.0f;

    w->params.am_rumble_depth   = 0.32f;
    w->params.am_sub_depth      = 0.14f;

    w->params.noise_post_lpf_hz = 1050.0f;
    w->params.noise_mix         = 0.055f;
#endif //defined(EN_ORG)


    /* EO (perceptual model) - V8 uses EO=2.0 from simultaneous/semi-simultaneous firing pairs */

    switch (s->type)
    {
    default:
    case ENG_I4:  w->params.eo = 2.0f; s->numHarm = 12; break;
    case ENG_I5:  w->params.eo = 2.5f; s->numHarm = 12; break;
    case ENG_I6:  w->params.eo = 3.0f; s->numHarm = 10; break;
    case ENG_V8:  w->params.eo = 2.0f; s->numHarm = 8;  break; // Cross-plane V8 perceptual EO=2.0
    case ENG_V12: w->params.eo = 6.0f; s->numHarm = 10; break;
    }

    /* From here, init what used to be static */
    w->rpm_ref_smooth = s->rpm_cur;

    w->lfo1_phase = 0.0f;
    w->lfo2_phase = 0.0f;
    w->rum_phase  = 0.0f;
    w->sub_phase  = 0.0f;

    w->rng        = 0x9E3779B9u;
    w->noise_lp   = 0.0f;

    memset(&w->eq, 0, sizeof(w->eq));
    memset(&w->lp, 0, sizeof(w->lp));
}







void EngineSynth_setRPM(engine_synth_t* s, float rpm_now)
{
    s->rpm_cur = s->rpm_tgt = rpm_now;
}

void EngineSynth_setTargetRPM(engine_synth_t* s, float rpm_target, float slew_rpm_per_s)
{
    s->rpm_tgt = (rpm_target < 0) ? 0 : rpm_target;
    if (slew_rpm_per_s > 0) s->rpm_slew_per_s = slew_rpm_per_s;
}

void EngineSynth_setThrottle(engine_synth_t* s, float thr_0to1)
{
    if (thr_0to1 < 0) thr_0to1 = 0;
    if (thr_0to1 > 1) thr_0to1 = 1;
    s->throttle = thr_0to1;
}

//temp //===========================================================
//temp // For V8 rumble: even up / odd down and calmer at high RPM
//temp //   - Auto-adjust even/odd/tilt/numHarm based on RPM
//temp //   - Call timing: each frame or when RPM changes
//temp //===========================================================
//temp void EngineRumble_applyV8Tone(engine_synth_t* s, float rpm)
//temp {
//temp     // Base: presets per RPM range for V8
//temp     float evenBoost, oddBoost, tilt;
//temp     int   numHarm;
//temp 
//temp     if (rpm < 1500.0f) {
//temp         evenBoost = +6.0f;   // stronger even
//temp         oddBoost  = -3.0f;   // weaker odd
//temp         tilt      = -3.5f;   // slightly brighter
//temp         numHarm   = 12;      // more harmonics at low RPM
//temp     } else if (rpm < 3000.0f) {
//temp         evenBoost = +4.0f;
//temp         oddBoost  = -2.0f;
//temp         tilt      = -5.0f;
//temp         numHarm   = 10;
//temp     } else {
//temp         evenBoost = +2.0f;
//temp         oddBoost  = -4.0f;   // reduce odd more at high RPM
//temp         tilt      = -6.0f;   // stronger high roll-off (less synthy)
//temp         numHarm   = 8;       // reduce harmonic count
//temp     }
//temp 
//temp     // Apply (do not touch other tone elements)
//temp     engine_tone_t t = s->tone;
//temp     t.evenBoost_dB     = evenBoost;
//temp     t.oddBoost_dB      = oddBoost;
//temp     t.tilt_dB_per_oct  = tilt;
//temp     t.numHarm          = (numHarm > ENGINE_MAX_HARM) ? ENGINE_MAX_HARM : numHarm;
//temp 
//temp     s->tone    = t;
//temp     s->numHarm = t.numHarm;
//temp }

//===========================================================
// LFO (low-frequency wobble) settings: modulate f0 by +/- depth ratio
//   - depth_pct: e.g., 4.0f -> +/-4%
//   - freq_hz  : e.g., 2.0f (gentle at 2 Hz)
//   - Keep as file-scope accessible if you want to call from anywhere
//===========================================================
//static float g_lfo_phase = 0.0f;
//static float g_lfo_freq_hz = 2.0f;
//static float g_lfo_depth = 0.04f;   // = 4% (+/-0.04)

void EngineRumble_setLFO(float freq_hz, float depth_pct)
{
    (void)depth_pct;

    if (freq_hz < 0.1f)  freq_hz = 0.1f;
    if (freq_hz > 10.0f) freq_hz = 10.0f;

//    // % -> ratio
//    float d = depth_pct * 0.01f;
//    if (d < 0.0f) d = 0.0f;
//    if (d > 0.10f) d = 0.10f;  // limit to +/-10% (prevent instability)

//    g_lfo_freq_hz = freq_hz;
//    g_lfo_depth   = d;
}




void engine_process(enginesynth_wrap_t* w, float* p_in, float* p_out, int samples)
{
    // ==== Fixed params for high-RPM behavior (simple version) ====
    const float RPM_TILT_AM_TH    = 4000.0f;  // threshold for harmonics & AM

    const float TILT_DELTA_DB_OCT = -2.0f;   // additional tilt beyond 4000 rpm (-2 dB/oct)
    const int   HIHARM_START_K    = 6;       // additional damping beyond k>6 at >=4000 rpm
    const float HIHARM_SLOPE_DB   = -1.0f;   // -1 dB per harmonic index above threshold

    const float AM_RUMBLE_SCALE_HI = 0.7f;   // reduce AM(f0/2) to 0.7 beyond 4000 rpm

    // ==== Noise enhancement (smooth interpolation) ====
    const float RPM_NOISE_START   = 4600.0f;   // start ramp here
    const float RPM_NOISE_END     = 6400.0f;   // reach max here
    const float NOISE_BOOST_DB    = +8.0f;     // max boost
    const float NOISE_FC_MULT_MAX = 1.25f;     // max LPF fc multiplier (x1.25)
    const float NOISE_PULSE_MIX   = 0.7f;      // 0=sine, 1=hard half-wave rectified

    engine_synth_t* s = &w->core;
    const float fs = s->fs;

    // ==== Low EQ (peaking EQ) ====
    const float EQ_FC_HZ   = w->params.eq_fc_hz;
    const float EQ_GAIN_DB = w->params.eq_gain_db;
    const float EQ_Q       = w->params.eq_q;

    // ==== Variable lowpass ====
    const float LPF_MIN_HZ = w->params.lpf_min_hz;
    const float LPF_MAX_HZ = w->params.lpf_max_hz;
    const float LPF_MULT   = w->params.lpf_mult;
    const float LPF_Q      = w->params.lpf_q;

    // ==== AM ====
    const float AM_RUMBLE_DEPTH = w->params.am_rumble_depth;
    const float AM_SUB_DEPTH    = w->params.am_sub_depth;

