gururaj-shet/dsPIC-AI-Demo-AEC-EQ/src/audio/engine_synth.c
    // ==== Noise ====
    const float NOISE_POST_LPF_HZ = w->params.noise_post_lpf_hz;
    const float NOISE_MIX         = w->params.noise_mix;

    // EO
    const float EO  = w->params.eo;

    float rpm_start = s->rpm_cur;
    float rpm_end   = s->rpm_tgt;

    // Slew-rate limiting
    {
        float max_delta = s->rpm_slew_per_s * ((float)samples / fs);
        float desired   = rpm_end - rpm_start;
        if (desired >  max_delta) rpm_end = rpm_start + max_delta;
        if (desired < -max_delta) rpm_end = rpm_start - max_delta;
    }

    const int   buf_ch = w->in_buf_ch;
    const int   slot_L = w->slot_L;
    const int   slot_R = w->slot_R;
    const float mix_g  = w->mixGain;

    // ---------------- Effective params for V8 (continuous interp + hysteresis) ----------------
    float eff_evenBoost_dB = s->tone.evenBoost_dB;
    float eff_oddBoost_dB  = s->tone.oddBoost_dB;
    float eff_tilt_dB_per_oct = s->tone.tilt_dB_per_oct;
    int   eff_numHarm = s->numHarm;

    // RPM smoothing (preserve wrap)
    {
        const float alpha = 0.2f; // around 5-10 Hz
        float rpm_ref = rpm_end;
        w->rpm_ref_smooth = (1.0f - alpha) * w->rpm_ref_smooth + alpha * rpm_ref;
    }

    if (s->type == ENG_V8) {
        const float L_even=+6.0f, L_odd=-3.0f, L_tilt=-3.5f;
        const float M_even=+4.0f, M_odd=-2.0f, M_tilt=-5.0f;
        const float H_even=+2.0f, H_odd=-5.0f, H_tilt=-10.0f;

        float w_LM, w_MH;
        { float x=(w->rpm_ref_smooth-1400.0f)/200.0f; if(x<0)x=0; if(x>1)x=1; w_LM=x*x*(3-2*x); }
        { float x=(w->rpm_ref_smooth-2900.0f)/200.0f; if(x<0)x=0; if(x>1)x=1; w_MH=x*x*(3-2*x); }

        float even_LM = (1.0f - w_LM) * L_even + w_LM * M_even;
        float odd_LM  = (1.0f - w_LM) * L_odd  + w_LM * M_odd;
        float tilt_LM = (1.0f - w_LM) * L_tilt + w_LM * M_tilt;

        eff_evenBoost_dB    = (1.0f - w_MH) * even_LM + w_MH * H_even;
        eff_oddBoost_dB     = (1.0f - w_MH) * odd_LM  + w_MH * H_odd;
        eff_tilt_dB_per_oct = (1.0f - w_MH) * tilt_LM + w_MH * H_tilt;

        // Further emphasize even up / odd down (more "rumbly")
        eff_evenBoost_dB += +1.5f;
        eff_oddBoost_dB  += -2.0f;

        // numHarm step switching (with hysteresis)
        static int numHarm_state;
        if      (w->rpm_ref_smooth < 1450.0f) numHarm_state = 12;
        else if (w->rpm_ref_smooth > 1550.0f && w->rpm_ref_smooth < 2950.0f) numHarm_state = 8;
        else if (w->rpm_ref_smooth > 3050.0f) numHarm_state = 6;
        else                                  numHarm_state = 12;

        eff_numHarm = numHarm_state;
        if (eff_numHarm > s->numHarm) eff_numHarm = s->numHarm;
        if (eff_numHarm < 1)          eff_numHarm = 1;
    }

    // ---------------- Precompute f0 at frame head and harmonic gains ----------------
    float f0_head = (rpm_start / 60.0f) * EO;
    if (f0_head < 1.0f) f0_head = 1.0f;

    struct { int k_max; float gain_k[ENGINE_MAX_HARM]; } pc;

    {
        int kmax_nyq = (int)floorf((0.48f * fs) / f0_head);
        int kmax = (eff_numHarm < kmax_nyq) ? eff_numHarm : kmax_nyq;
        if (kmax < 1) kmax = 1;
        pc.k_max = kmax;

        const float inv_ln2 = 1.4426950408889634f;
        for (int k = 1; k <= kmax; k++) {
            float A      = s->tone.A_linear[k - 1];
            float add_dB = ((k & 1) ? eff_oddBoost_dB : eff_evenBoost_dB);
            float oct    = logf((float)k) * inv_ln2;
            add_dB      += eff_tilt_dB_per_oct * oct;

            // --- "Drying" at high RPM: beyond 4000 rpm, strengthen tilt and damp high-order ---
            if (rpm_end >= RPM_TILT_AM_TH)
            {
                add_dB += TILT_DELTA_DB_OCT * oct;  // additional -2 dB/oct tilt
                if (k > HIHARM_START_K)
                {
                    add_dB += HIHARM_SLOPE_DB * (float)(k - HIHARM_START_K); // k>6: -1 dB/order
                }
            }
            else
            {
                // Legacy anti-whistle measure (keep for low-mid RPM)
                if (k > 4)
                {
                    add_dB += -2.0f * (float)(k - 4);
                }
            }

            pc.gain_k[k - 1] = A * dB_to_linear(add_dB);
        }
    }

    // ---------------- Peaking EQ coefficients (per frame) ----------------
    {
        float A   = powf(10.0f, EQ_GAIN_DB * 0.05f);  // 10^(dB/40)
        float w0  = 2.0f * (float)M_PI * EQ_FC_HZ / fs;
        float c   = cosf(w0);
        float s0  = sinf(w0);
        float alpha = s0 / (2.0f * EQ_Q);

        float b0 = 1.0f + alpha * A;
        float b1 = -2.0f * c;
        float b2 = 1.0f - alpha * A;
        float a0 = 1.0f + alpha / A;
        float a1 = -2.0f * c;
        float a2 = 1.0f - alpha / A;

        w->eq.bq.b0 = b0/a0;
        w->eq.bq.b1 = b1/a0;
        w->eq.bq.b2 = b2/a0;
        w->eq.bq.a1 = a1/a0;
        w->eq.bq.a2 = a2/a0;
    }

    // ---------------- Variable LPF coefficients (smooth fc target -> coeffs) ----------------
    {
        float f0_avg = ((rpm_start + rpm_end) * 0.5f) / 60.0f * EO;
        if (f0_avg < 1.0f) f0_avg = 1.0f;
        float fc_target = LPF_MULT * f0_avg;
        if (fc_target < LPF_MIN_HZ) fc_target = LPF_MIN_HZ;
        if (fc_target > LPF_MAX_HZ) fc_target = LPF_MAX_HZ;

        const float tau_sec = 0.030f;                // 30 ms
        float dt = (float)samples / fs;
        float beta = 1.0f - expf(-dt / tau_sec);
        if (w->lp_fc_smooth <= 0.0f) {
            w->lp_fc_smooth = fc_target;
        } else {
            w->lp_fc_smooth += beta * (fc_target - w->lp_fc_smooth);
        }

        float w0  = 2.0f * (float)M_PI * w->lp_fc_smooth / fs;
        float c   = cosf(w0);
        float s0  = sinf(w0);
        float alpha = s0 / (2.0f * LPF_Q);

        float b0 = (1.0f - c) * 0.5f;
        float b1 =  1.0f - c;
        float b2 = (1.0f - c) * 0.5f;
        float a0 =  1.0f + alpha;
        float a1 = -2.0f * c;
        float a2 =  1.0f - alpha;

        w->lp.bq.b0 = b0/a0;
        w->lp.bq.b1 = b1/a0;
        w->lp.bq.b2 = b2/a0;
        w->lp.bq.a1 = a1/a0;
        w->lp.bq.a2 = a2/a0;
    }

    // ---- Simple first-order LPF for noise (basic IIR)----
//    const float noise_alpha_base = expf(-2.0f * (float)M_PI * NOISE_POST_LPF_HZ / fs);

    // RNG helper
    #define XRAND01() ( \
        w->rng ^= (w->rng<<13), w->rng ^= (w->rng>>17), w->rng ^= (w->rng<<5), \
        ((w->rng & 0xFFFFFFFFu) * 2.3283064365386963e-10f) \
    )

    // Mix gain for detuned bank B (relative)
/// test   const float detune_mix_gain = powf(10.0f, (-8.0f) / 20.0f); // -8 dB
    // From -8 dB to -6 dB (slightly louder)
    const float detune_mix_gain = powf(10.0f, (-6.0f) / 20.0f);


    // Small random detune (move to wrap if you need isolated instances)
    static float detune_jitter_c = 0.0f; // +/- 1 cent
    static float jitter_phase = 0.0f;    // 4 Hz

