gururaj-shet/dsPIC-AI-Demo-AEC-EQ/src/audio/engine_synth.c
    for (int smp = 0; smp < samples; smp++)
    {
        float t   = (samples <= 1) ? 1.0f : (float)smp / (float)(samples - 1);
        float rpm = rpm_start + (rpm_end - rpm_start) * t;

        // Base f0
        float f0  = (rpm / 60.0f) * EO;
        if (f0 < 1.0f) f0 = 1.0f;

        // --- Detune computation (RPM-linked + small random) ---
        float detune_c; // cent
        if      (rpm <= 2000.0f) detune_c = 3.0f;
        else if (rpm >= 7000.0f) detune_c = 6.5f;
        else if (rpm <= 5000.0f) {
            float uu = (rpm - 2000.0f)/3000.0f;              // 0..1
            detune_c = 3.0f + (5.0f - 3.0f)*uu;              // 3 -> 5
        } else {
            float uu = (rpm - 5000.0f)/2000.0f;              // 0..1
            detune_c = 5.0f + (6.5f - 5.0f)*uu;              // 5 -> 6.5
        }
        // Slow +/-1 cent random (update around 4 Hz)
        jitter_phase += 2.0f*(float)M_PI * 4.0f / fs;       // 4 Hz
        if (jitter_phase >= 2.0f*(float)M_PI) {
            jitter_phase -= 2.0f*(float)M_PI;
            float r = (XRAND01()*2.0f - 1.0f);              // [-1,1]
//            detune_jitter_c = r * 1.0f;                     // +/-1 cent
/// test
            // Jitter width: +/-1.0 cent -> +/-1.5 cent
            detune_jitter_c = r * 1.5f;  // was 1.0f
            // Jitter update ~4 Hz stays OK (3.5~5 Hz also fine)
        }
        detune_c += detune_jitter_c;

        const float detune_ratio = powf(2.0f, detune_c / 1200.0f); // 2^(cent/1200)

        // === FM (light, continuous) ===
        const float lfo1_f = 3.0f,  lfo1_d = 0.010f;
        const float lfo2_f = 12.0f, lfo2_d = 0.0025f;
        float rum_f = 0.5f * f0; if (rum_f < 0.5f) rum_f = 0.5f;

        w->lfo1_phase += 2.0f*(float)M_PI * lfo1_f / fs;
        w->lfo2_phase += 2.0f*(float)M_PI * lfo2_f / fs;
        w->rum_phase  += 2.0f*(float)M_PI * rum_f  / fs;
        w->sub_phase  += 2.0f*(float)M_PI * (0.25f * f0) / fs;

        if (w->lfo1_phase >= 2.0f*(float)M_PI) w->lfo1_phase -= 2.0f*(float)M_PI;
        if (w->lfo2_phase >= 2.0f*(float)M_PI) w->lfo2_phase -= 2.0f*(float)M_PI;
        if (w->rum_phase  >= 2.0f*(float)M_PI) w->rum_phase  -= 2.0f*(float)M_PI;
        if (w->sub_phase  >= 2.0f*(float)M_PI) w->sub_phase  -= 2.0f*(float)M_PI;

        float wobble_raw = lfo1_d * sinf(w->lfo1_phase)
                         + lfo2_d * sinf(w->lfo2_phase)
                         + 0.016f * sinf(w->rum_phase); // keep f0/2 FM modest

        const float W_MAX = 0.05f; // +/-5%
        float wobble = 1.0f + W_MAX * tanhf(wobble_raw / W_MAX);
        f0 *= wobble;

        // === Phase update ===
        float dphi0 = 2.0f * (float)M_PI * f0 / fs;
        s->phase0 += dphi0;
        if (s->phase0 >= 2.0f*(float)M_PI) s->phase0 -= 2.0f*(float)M_PI;

        // === Harmonic synthesis A (reference bank) ===
        float yA = 0.0f;
        for (int k = 1; k <= pc.k_max; k++) {
            yA += pc.gain_k[k - 1] * sinf(s->phase0 * (float)k);
        }

        // === Harmonic synthesis B (detuned bank 2: V8 only) ===
        float y = yA;
        if (s->type == ENG_V8) {
            float fB = f0 * detune_ratio;
            float dphiB = 2.0f * (float)M_PI * fB / fs;
            w->phase_bankB += dphiB;
            if (w->phase_bankB >= 2.0f*(float)M_PI) w->phase_bankB -= 2.0f*(float)M_PI;

            float yB = 0.0f;
            for (int k = 1; k <= pc.k_max; k++) {
                yB += pc.gain_k[k - 1] * sinf(w->phase_bankB * (float)k);
            }
            y += detune_mix_gain * yB;
        }

        // === AM (f0/2 and f0/4) ===
        {
            // Make AM(f0/2) slightly shallower above 4000 rpm
            float AM_RUMBLE_DEPTH_eff = AM_RUMBLE_DEPTH;
            if (rpm >= RPM_TILT_AM_TH) {
                AM_RUMBLE_DEPTH_eff *= AM_RUMBLE_SCALE_HI; // x0.7
            }
            float am_env = 1.0f
                         + AM_RUMBLE_DEPTH_eff * sinf(w->rum_phase)  // f0/2
                         + AM_SUB_DEPTH        * sinf(w->sub_phase); // f0/4

            if (am_env < 0.0f) am_env = 0.0f;
            y *= am_env;
        }

        // === Small noise (smooth ramp-in + pulse gate) ===
        {
            // u as a function of rpm: 0->1 between RPM_NOISE_START and END
            float x = (rpm - RPM_NOISE_START) / (RPM_NOISE_END - RPM_NOISE_START + 1e-9f);
            if (x < 0.0f) x = 0.0f; else if (x > 1.0f) x = 1.0f;
            float u = x * x * (3.0f - 2.0f * x); // smoothstep

            // Gate (blend of sine and half-wave rectified)
            float gate_sine = 0.5f + 0.5f * sinf(w->rum_phase);  // 0..1
            float gate_half = fmaxf(0.0f, sinf(w->rum_phase));   // 0..1
            float gate = (1.0f - NOISE_PULSE_MIX) * gate_sine + NOISE_PULSE_MIX * gate_half;

            // Multiply white noise by gate
            float uwhite = (XRAND01() * 2.0f - 1.0f) * gate;     // -1..1

            // Smoothly interpolate noise LPF fc via u (base -> brighter)
            float fc_eff_mult = 1.0f + (NOISE_FC_MULT_MAX - 1.0f) * u;          // 1.0 -> NOISE_FC_MULT_MAX
            float noise_alpha_eff = expf(-2.0f * (float)M_PI
                                         * (NOISE_POST_LPF_HZ * fc_eff_mult) / fs);

            // 1st-order LPF
            w->noise_lp = noise_alpha_eff * w->noise_lp + (1.0f - noise_alpha_eff) * uwhite;

            // Interpolate noise amount by u (0 -> +NOISE_BOOST_DB)
            float noise_mix_eff = NOISE_MIX * (1.0f + (dB_to_linear(NOISE_BOOST_DB) - 1.0f) * u);

            y += noise_mix_eff * w->noise_lp;
        }

        // === Shaping -> EQ -> LPF ===
        y *= s->tone.baseGain;
        if (s->tone.outSoftLimit > 0.0f) {
            float lim = s->tone.outSoftLimit;
            y = lim * tanhf(y / lim);
        }

        // Peaking EQ (DF2T)
        float y1     = w->eq.bq.b0 * y + w->eq.bqs.z1;
        w->eq.bqs.z1 = w->eq.bq.b1 * y + w->eq.bqs.z2 - w->eq.bq.a1 * y1;
        w->eq.bqs.z2 = w->eq.bq.b2 * y                - w->eq.bq.a2 * y1;

        // Lowpass (DF2T)
        float     y2 = w->lp.bq.b0 * y1 + w->lp.bqs.z1;
        w->lp.bqs.z1 = w->lp.bq.b1 * y1 + w->lp.bqs.z2 - w->lp.bq.a1 * y2;
        w->lp.bqs.z2 = w->lp.bq.b2 * y1                - w->lp.bq.a2 * y2;

        // Output
        int   base   = smp   * buf_ch;
        float outval = mix_g * y2;
        if (slot_L >= 0) p_out[base + slot_L] = p_in[base + slot_L] + outval;
        if (slot_R >= 0) p_out[base + slot_R] = p_in[base + slot_R] + outval;
    }

    s->rpm_cur = rpm_end;
}


